 [
    {
      "intent": "cuts",
      "patterns": {
        "en": ["cuts", "wounds", "scratches"],
        "hi": ["कट", "घाव", "खरोंच"],
        "ta": ["கட்டு", "காயங்கள்", "சரிவு"]
      },
      "responses": {
        "en": [
          "1. Clean the wound with clean, running water to remove any dirt or debris.",
          "2. Apply a mild antiseptic to prevent infection.",
          "3. Cover the wound with a sterile bandage or dressing.",
          "4. Change the bandage regularly and keep the wound clean.",
          "5. If the cut is deep or bleeding heavily, seek medical attention immediately."
        ],
        "hi": [
          "1. घाव को साफ पानी से धोएं ताकि कोई गंदगी या मलबा हट सके।",
          "2. संक्रमण को रोकने के लिए एक हल्का एंटीसेप्टिक लगाएं।",
          "3. घाव को एक स्टेराइल बैंडेज या ड्रेसिंग से ढकें।",
          "4. बैंडेज को नियमित रूप से बदलें और घाव को साफ रखें।",
          "5. यदि कट गहरा है या भारी खून बह रहा है, तो तुरंत चिकित्सा सहायता प्राप्त करें।"
        ],
        "ta": [
          "1. காயத்தை தூய்மையான, ஓடும் நீரால் சுத்தம் செய்யுங்கள், மாசு அல்லது முக்குக்களை நீக்குங்கள்.",
          "2. தொற்று தடுக்க ஒரு மெல்லிய மருந்து பயன்படுத்துங்கள்.",
          "3. காயத்தை ஒரு தூய்மையான பந்தியோ அல்லது ஆவணத்தோடு மூடுங்கள்.",
          "4. பந்தியை நியமிக்கையால் மாற்றுங்கள் மற்றும் காயத்தை தூய்மையாக பராமரியுங்கள்.",
          "5. காயம் ஆழமாகவோ அல்லது முக்குக் கடுமையாகப் பசிவதாகவோ இருந்தால், உடனடியாக மருத்துவ உதவியைப் பெறுங்கள்."
        ]
      }
    },
    {
      "intent": "allergic_reactions",
      "patterns": {
        "en": ["allergic reactions", "allergy", "allergic"],
        "hi": ["एलर्जी", "एलर्जिक प्रतिक्रिया", "एलर्जी"],
        "ta": ["அலர்ஜி", "அலர்ஜிக் பதில்கள்", "அலர்ஜி"]
      },
      "responses": {
        "en": [
          "1. Identify and remove the allergen if possible.",
          "2. Take an antihistamine to alleviate symptoms.",
          "3. If the reaction is severe, administer an epinephrine injection if prescribed.",
          "4. Drink plenty of water to stay hydrated.",
          "5. Seek immediate medical attention if symptoms worsen or if there's difficulty breathing."
        ],
        "hi": [
          "1. यदि संभव हो तो एलर्जन की पहचान करें और उसे हटा दें।",
          "2. लक्षणों को कम करने के लिए एक एंटीहिस्टामाइन लें।",
          "3. यदि प्रतिक्रिया गंभीर है, तो निर्धारित होने पर एपिनेफ्रीन इंजेक्शन दें।",
          "4. हाइड्रेटेड रहने के लिए बहुत सारा पानी पिएं।",
          "5. यदि लक्षण बिगड़ते हैं या सांस लेने में कठिनाई होती है तो तुरंत चिकित्सा सहायता प्राप्त करें।"
        ],
        "ta": [
          "1. அழர்ஜியை கண்டுபிடித்து, அதை அகற்றுங்கள்.",
          "2. அடிகரிகையாளர்களை எடுத்துக்கொள்ளவும்.",
          "3. பதிலுக்கு கடுமையாக இருந்தால், மருந்திடும்போது எபினெபிரினை செலுத்தவும்.",
          "4. நன்கு நீரிழிந்த நிலை பராமரிக்க நீரைக் குடிக்கவும்.",
          "5. குறிப்புகள் அதிகரிக்கவும் அல்லது மூச்சு பிரச்சினைகள் இருந்தால் உடனடியாக மருத்துவ உதவியைப் பெறுங்கள்."
        ]
      }
    },
    {
      "intent": "fainting",
      "patterns": {
        "en": ["fainting", "loss of consciousness", "faint"],
        "hi": ["बेहोशी", "होश खोना", "फaint होना"],
        "ta": ["மயக்கம்", "அறிவிழப்பு", "அழுகை"]
      },
      "responses": {
        "en": [
          "1. Lay the person down on their back in a safe place.",
          "2. Elevate their legs to improve blood flow to the brain.",
          "3. Ensure the person is in a comfortable and well-ventilated area.",
          "4. If the person does not regain consciousness quickly, seek medical help immediately.",
          "5. Monitor their breathing and pulse while waiting for medical assistance."
        ],
        "hi": [
          "1. व्यक्ति को उनकी पीठ के बल एक सुरक्षित जगह पर लिटा दें।",
          "2. उनके पैर ऊंचे कर दें ताकि रक्त प्रवाह मस्तिष्क की ओर बढ़े।",
          "3. सुनिश्चित करें कि व्यक्ति एक आरामदायक और अच्छी तरह से वेंटिलेटेड क्षेत्र में हो।",
          "4. यदि व्यक्ति जल्दी से होश में नहीं आता है, तो तुरंत चिकित्सा सहायता प्राप्त करें।",
          "5. चिकित्सा सहायता के लिए इंतजार करते समय उनकी सांस और नाड़ी की निगरानी करें।"
        ],
        "ta": [
          "1. மயக்கம் அடைந்தவர்களை எங்கள் முதுகில் பாதுகாப்பான இடத்தில் படுக்க வைக்கவும்.",
          "2. அவர்களின் கால்களை உயர்த்தி, மூளைக்கு இரத்தப்போக்கைக் மேம்படுத்தவும்.",
          "3. நன்கு காற்றோட்டம் உள்ள, வசதியான இடத்தில் இருப்பதை உறுதி செய்யவும்.",
          "4. அவர் விரைவில் விழிப்புக்கூறாவிடில், உடனடியாக மருத்துவ உதவியைப் பெறவும்.",
          "5. மருத்துவ உதவிக்காக காத்திருக்கும் போது அவர்களின் மூச்சு மற்றும் நொடியை கண்காணிக்கவும்."
        ]
      }
    },
    {
      "intent": "heat_stroke",
      "patterns": {
        "en": ["heat stroke", "overheating", "heat exhaustion"],
        "hi": ["हीट स्ट्रोक", "ओवरहीटिंग", "हीट एग्जॉर्शन"],
        "ta": ["சூடுபிடிப்பு", "அதிக வெப்பம்", "சூடுபிடிப்பு"]
      },
      "responses": {
        "en": [
          "1. Move the person to a cooler environment immediately.",
          "2. Remove excess clothing and apply cool, damp cloths to their skin.",
          "3. Offer them water or electrolyte drinks to rehydrate.",
          "4. Monitor their temperature and keep them in a shaded area.",
          "5. Seek emergency medical help if their condition does not improve or if they show severe symptoms."
        ],
        "hi": [
          "1. व्यक्ति को तुरंत ठंडे वातावरण में ले जाएं।",
          "2. अतिरिक्त कपड़े हटा दें और उनकी त्वचा पर ठंडे, गीले कपड़े लगाएं।",
          "3. उन्हें पानी या इलेक्ट्रोलाइट पेय दें ताकि वे हाइड्रेटेड रहें।",
          "4. उनकी तापमान की निगरानी करें और उन्हें छायादार क्षेत्र में रखें।",
          "5. यदि उनकी स्थिति में सुधार नहीं होता है या वे गंभीर लक्षण दिखाते हैं, तो आपातकालीन चिकित्सा सहायता प्राप्त करें।"
        ],
        "ta": [
          "1. உடனடியாக அவர்களை குளிர்ச்சியான சூழலுக்கு மாற்றவும்.",
          "2. அதிக உடைகள் நீக்கவும் மற்றும் அவர்களின் தோலுக்கு குளிர்ந்த, ஈரமான துணிகள் வைக்கவும்.",
          "3. அவர்களுக்கு நீர் அல்லது மினரல் பானங்கள் வழங்கவும்.",
          "4. அவர்களின் வெப்பத்தை கண்காணிக்கவும் மற்றும் அவர்களை நிழலான பகுதியில் வைக்கவும்.",
          "5. அவர்கள் நிலை மேம்படாத நிலையில் அல்லது கடுமையான அறிகுறிகள் காணப்படும்போது அவசர மருத்துவ உதவியைப் பெறுங்கள்."
        ]
      }
    },
    {
      "intent": "shivering",
      "patterns": {
        "en": ["shivering", "chills", "trembling"],
        "hi": ["कंपकंपाना", "ठंड लगना", "कंपन"],
        "ta": ["சரசரப்பி", "தரணல்", "அதிக துடிப்பு"]
      },
      "responses": {
        "en": [
          "1. Move the person to a warm, dry place.",
          "2. Cover them with warm blankets or clothing.",
          "3. Provide warm drinks to help increase their body temperature.",
          "4. Ensure they are in a comfortable position and monitor their condition.",
          "5. Seek medical help if shivering persists or if they show signs of hypothermia."
        ],
        "hi": [
          "1. व्यक्ति को गर्म और सूखे स्थान पर ले जाएं।",
          "2. उन्हें गर्म कंबल या कपड़े से ढकें।",
          "3. उनके शरीर के तापमान को बढ़ाने के लिए गर्म पेय दें।",
          "4. सुनिश्चित करें कि वे आरामदायक स्थिति में हैं और उनकी स्थिति की निगरानी करें।",
          "5. यदि कंपकंपाना जारी रहता है या वे हाइपोथर्मिया के लक्षण दिखाते हैं, तो चिकित्सा सहायता प्राप्त करें।"
        ],
        "ta": [
          "1. அவர்களை சூடான, உலர்ந்த இடத்திற்கு மாற்றவும்.",
          "2. அவர்களை சூடான துணிகள் அல்லது கம்பளியால் மூடுங்கள்.",
          "3. அவர்களின் உடல் வெப்பத்தை அதிகரிக்க சூடான பானங்களை வழங்குங்கள்.",
          "4. அவர்களை வசதியான நிலையில் வைக்கவும் மற்றும் அவர்களின் நிலையை கண்காணிக்கவும்.",
          "5. சரசரப்பி தொடர்ந்தால் அல்லது ஹைப்போத்தெர்மியா அறிகுறிகள் காணப்பட்டால், மருத்துவ உதவியைப் பெறுங்கள்."
        ]
      }
    },
    {
      "intent": "dehydration",
      "patterns": {
        "en": ["dehydration", "lack of water", "dryness"],
        "hi": ["डिहाइड्रेशन", "पानी की कमी", "सूखापन"],
        "ta": ["உரக்குறைவு", "தண்ணீரின் குறைவு", "உரமின்மை"]
      },
      "responses": {
        "en": [
          "1. Drink plenty of water or oral rehydration solutions.",
          "2. Avoid caffeine and alcohol as they can worsen dehydration.",
          "3. Rest in a cool, shaded area.",
          "4. Monitor symptoms and continue rehydration.",
          "5. Seek medical attention if symptoms are severe or if dehydration does not improve."
        ],
        "hi": [
          "1. बहुत सारा पानी या मौखिक हाइड्रेशन समाधान पिएं।",
          "2. कैफीन और शराब से बचें क्योंकि ये डिहाइड्रेशन को और खराब कर सकते हैं।",
          "3. ठंडे, छायादार क्षेत्र में विश्राम करें।",
          "4. लक्षणों की निगरानी करें और हाइड्रेशन जारी रखें।",
          "5. यदि लक्षण गंभीर हैं या डिहाइड्रेशन में सुधार नहीं हो रहा है, तो चिकित्सा सहायता प्राप्त करें।"
        ],
        "ta": [
          "1. நிறைய நீர் அல்லது வாய்வு உரத்தத் தண்ணீர் பருகவும்.",
          "2. காப்பின் மற்றும் மதுபானங்களை தவிர்க்கவும், அவை உலர்ச்சியை மோசமாக்கலாம்.",
          "3. குளிர்ந்த, நிழலான இடத்தில் ஓய்வு எடுக்கவும்.",
          "4. அறிகுறிகளை கண்காணிக்கவும் மற்றும் நீரிழுவை தொடரவும்.",
          "5. அறிகுறிகள் கடுமையாக இருப்பின் அல்லது நீரிழிவு மேம்படாவிடில், மருத்துவ உதவியைப் பெறுங்கள்."
        ]
      }
    },
    {
      "intent": "low_bp",
      "patterns": {
        "en": ["low blood pressure", "hypotension", "low BP"],
        "hi": ["निम्न रक्तचाप", "हाइपोटेंशन", "लो बीपी"],
        "ta": ["குறைந்த இரத்த அழுத்தம்", "ஹைப்போடென்ஷன்", "குறைந்த BP"]
      },
      "responses": {
        "en": [
          "1. Have the person lie down in a comfortable position.",
          "2. Elevate their legs to improve blood flow.",
          "3. Give them plenty of fluids to drink, preferably with electrolytes.",
          "4. Avoid standing up quickly; rise slowly.",
          "5. Seek medical attention if symptoms persist or worsen."
        ],
        "hi": [
          "1. व्यक्ति को आरामदायक स्थिति में लिटा दें।",
          "2. उनके पैरों को ऊंचा कर दें ताकि रक्त प्रवाह सुधरे।",
          "3. उन्हें बहुत सारे तरल पदार्थ दें, preferably इलेक्ट्रोलाइट्स के साथ।",
          "4. जल्दी से खड़े होने से बचें; धीरे-धीरे उठें।",
          "5. यदि लक्षण जारी रहते हैं या बिगड़ते हैं, तो चिकित्सा सहायता प्राप्त करें।"
        ],
        "ta": [
          "1. ஒருவரை வசதியான நிலையில் படுக்க வைக்கவும்.",
          "2. அவர்களின் கால்களை உயர்த்தி, இரத்த ஓட்டத்தை மேம்படுத்தவும்.",
          "3. அவர்களுக்கு அதிகமாக திரவங்களை குடிக்கவும், மினரல்களை சேர்க்க.",
          "4. திடீரென நிறைவைத் தவிர்க்கவும்; மெதுவாக எழுங்கள்.",
          "5. அறிகுறிகள் தொடர்ந்தால் அல்லது மோசமாகின் மருத்துவ உதவியைப் பெறுங்கள்."
        ]
      }
    },
    {
      "intent": "fever",
      "patterns": {
        "en": ["fever", "high temperature", "pyrexia"],
        "hi": ["बुखार", "उच्च तापमान", "पायरक्सिया"],
        "ta": ["வீக்கம்", "உயர்ந்த வெப்பநிலை", "பைரெக்ஸியா"]
      },
      "responses": {
        "en": [
          "1. Take a fever-reducing medication like acetaminophen or ibuprofen.",
          "2. Drink plenty of fluids to stay hydrated.",
          "3. Rest in a cool, comfortable environment.",
          "4. Use a fan or cool cloths to help lower body temperature.",
          "5. Seek medical advice if the fever persists for more than a few days or if it is very high."
        ],
        "hi": [
          "1. बुखार कम करने वाली दवा जैसे कि एसिटामिनोफेन या इबुप्रोफेन लें।",
          "2. हाइड्रेटेड रहने के लिए बहुत सारे तरल पदार्थ पिएं।",
          "3. ठंडे, आरामदायक वातावरण में आराम करें।",
          "4. शरीर के तापमान को कम करने के लिए पंखे या ठंडे कपड़े का उपयोग करें।",
          "5. यदि बुखार कुछ दिनों से अधिक समय तक रहता है या बहुत अधिक होता है, तो चिकित्सा सलाह प्राप्त करें।"
        ],
        "ta": [
          "1. வெப்பத்தை குறைக்கும் மருந்துகளை எடுத்துக் கொள்ளுங்கள், இது ஆசிடமினோபன் அல்லது இபூபிரோஃபேன்.",
          "2. நீரிழிவு சீராக இருக்க அதிகமாக திரவங்களை குடிக்கவும்.",
          "3. குளிர்ந்த, வசதியான சூழலில் ஓய்வுக்குக் கூடுங்கள்.",
          "4. உடல் வெப்பத்தை குறைக்க ஒரு குவளை அல்லது குளிர்ந்த துணிகளை பயன்படுத்துங்கள்.",
          "5. வெப்பம் சில நாட்கள் நீடிக்கிறதா அல்லது மிகவும் உயர்ந்தவையாக இருந்தால், மருத்துவ ஆலோசனையைப் பெறுங்கள்."
        ]
      }
    },
    {
      "intent": "vomiting",
      "patterns": {
        "en": ["vomiting", "nausea", "throwing up"],
        "hi": ["उल्टी", "मतली", "उल्टी करना"],
        "ta": ["உலர்வு", "அசமயம்", "வமிடு"]
      },
      "responses": {
        "en": [
          "1. Keep the person hydrated with small sips of water or an oral rehydration solution.",
          "2. Avoid solid foods until the vomiting subsides.",
          "3. Rest in a comfortable position and avoid strong smells.",
          "4. Try to identify and avoid any triggers that might have caused the vomiting.",
          "5. Seek medical help if vomiting persists for more than a day or is accompanied by severe symptoms."
        ],
        "hi": [
          "1. व्यक्ति को पानी या मौखिक हाइड्रेशन समाधान के छोटे घूंटों से हाइड्रेटेड रखें।",
          "2. उल्टी कम होने तक ठोस खाद्य पदार्थों से परहेज करें।",
          "3. आरामदायक स्थिति में विश्राम करें और तेज गंधों से बचें।",
          "4. उल्टी के कारणों की पहचान करने की कोशिश करें और उन्हें टालें।",
          "5. यदि उल्टी एक दिन से अधिक समय तक जारी रहती है या गंभीर लक्षणों के साथ होती है, तो चिकित्सा सहायता प्राप्त करें।"
        ],
        "ta": [
          "1. குறைந்த அளவு நீர் அல்லது வாய்வு திரவங்களை பருகி, நீரிழைவு அடிக்கவும்.",
          "2. வெப்பம் குறையும் வரை மாஸ் உணவுகளைக் தவிர்க்கவும்.",
          "3. வசதியான நிலையில் ஓய்வு எடுக்கவும் மற்றும் செரிமானங்கள் தவிர்க்கவும்.",
          "4. உலர்வை காரணமாக இருக்கும் அனைத்து மூலங்களைத் தவிர்க்கவும்.",
          "5. உலர்வு ஒரு நாளிலிருந்து மேலாக நீடிக்கிறதா அல்லது கடுமையான அறிகுறிகளைத் தவிர்க்கவும், மருத்துவ உதவியைப் பெறுங்கள்."
        ]
      }
    },
    {
      "intent": "diarrhea",
      "patterns": {
        "en": ["diarrhea", "loose stools", "frequent bowel movements"],
        "hi": ["दस्त", "पानी जैसा मल", "बार-बार शौच"],
        "ta": ["மோசடி", "தண்ணீர்ப்போன்ற களை", "மிகவும் அதிகமாக மலம்"]
      },
      "responses": {
        "en": [
          "1. Drink plenty of fluids to prevent dehydration, including oral rehydration solutions.",
          "2. Eat easily digestible foods like bananas, rice, and toast.",
          "3. Avoid dairy products, caffeine, and high-fat foods.",
          "4. Rest and monitor symptoms to ensure they do not worsen.",
          "5. Seek medical advice if diarrhea persists for more than a couple of days or if it is accompanied by severe symptoms."
        ],
        "hi": [
          "1. डिहाइड्रेशन से बचने के लिए बहुत सारे तरल पदार्थ पिएं, जिसमें मौखिक हाइड्रेशन समाधान भी शामिल हैं।",
          "2. आसानी से पचने वाले खाद्य पदार्थ जैसे केले, चावल और टोस्ट खाएं।",
          "3. डेयरी उत्पादों, कैफीन, और उच्च वसा वाले खाद्य पदार्थों से बचें।",
          "4. आराम करें और लक्षणों की निगरानी करें ताकि वे बिगड़ें नहीं।",
          "5. यदि दस्त कुछ दिनों से अधिक समय तक जारी रहता है या गंभीर लक्षणों के साथ होता है, तो चिकित्सा सलाह प्राप्त करें।"
        ],
        "ta": [
          "1. நீரிழிவைத் தடுக்கும் வகையில் அதிகமாக திரவங்களை பருகுங்கள், வாய்வு நீரிழைவு தீர்வுகள் உள்ளடக்கம்.",
          "2. எளிதில் செரிக்கும் உணவுகள் எளிதாக சாப்பிடுங்கள், இது வாழை, அரிசி மற்றும் டோஸ்ட்.",
          "3. பாலூட்டிய உபாதிகள், காப்பின் மற்றும் அதிக கொழுப்பு உணவுகளைத் தவிர்க்கவும்.",
          "4. ஓய்வில் இருப்பதைக் காணுங்கள் மற்றும் அறிகுறிகளை கண்காணிக்கவும்.",
          "5. முதன்மை உரை திரைவேண்டும் அளவிலான ஒப்புரவு நீடிக்கிறதா அல்லது கடுமையான அறிகுறிகளைச் சந்திக்கிறவா என்றால், மருத்துவ ஆலோசனையைப் பெறுங்கள்."
        ]
      }
    }
  ]

